ti-cortex-m4/tm4c1294ncpdt/ek-tm4c1294xl/project2/self/uart/serial.c
/*------------------------------------------------------------------------------
SERIAL,C


------------------------------------------------------------------------------*/

#include "../main.h"
#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_sysctl.h"
#include "inc/hw_types.h"
#include "inc/hw_uart.h"
#include "driverlib/debug.h"
#include "driverlib/gpio.h"
#include "driverlib/interrupt.h"
#include "driverlib/sysctl.h"
#include "driverlib/uart.h"
#include "utils/ringbuf.h"
#include "../uart/io_mode.h"
#include "serial.h"



// The buffer used to hold characters received from the UARTs.
static uint8_t mmbRxBuf[UART_COUNT][RX_RING_BUF_SIZE];

// The buffer used to hold characters to be sent to the UARTs.
static uint8_t mmbTxBuf[UART_COUNT][TX_RING_BUF_SIZE];


// The ring buffers used to hold characters received from the UARTs.
tRingBufObject g_sRxBuf[UART_COUNT];

// The ring buffers used to hold characters to be sent to the UARTs.
tRingBufObject g_sTxBuf[UART_COUNT];


//! The base address for the UART associated with a port.
const uint32_t g_ulUARTBase[UART_COUNT] =
{
    UART0_BASE,
    UART4_BASE,
    UART3_BASE,
    UART2_BASE,
    UART1_BASE,
};



//*****************************************************************************
//! Handles the UART interrupt.
//!
//! \param ulPort is the serial port number to be accessed.
//!
//! This function is called when either of the UARTs generate an interrupt.
//! An interrupt will be generated when data is received and when the transmit
//! FIFO becomes half empty.  The transmit and receive FIFOs are processed as
//! appropriate.
//!
//! \return None.
//*****************************************************************************
static void SerialUARTIntHandler(uint32_t ulPort)
{
    uint32_t ulStatus;
    uint8_t ucChar;

    // Get the cause of the interrupt.
    ulStatus = UARTIntStatus(g_ulUARTBase[ulPort], true);

    // Clear the cause of the interrupt.
    UARTIntClear(g_ulUARTBase[ulPort], ulStatus);

    // See if there is data to be processed in the receive FIFO.
    if(ulStatus & (UART_INT_RT | UART_INT_RX))
    {
        // Loop while there are characters available in the receive FIFO.
        while(UARTCharsAvail(g_ulUARTBase[ulPort]))
        {
            // Get the next character from the receive FIFO.
            ucChar = UARTCharGet(g_ulUARTBase[ulPort]);

#ifdef PROTOCOL_TELNET
            // If Telnet protocol enabled, check for incoming IAC character,
            // and escape it.
            if((g_sParameters.sPort[ulPort].ucFlags &
                        PORT_FLAG_PROTOCOL) == PORT_PROTOCOL_TELNET)
            {
                // If this is a Telnet IAC character, write it twice.
                if((ucChar == TELNET_IAC) &&
                   (RingBufFree(&g_sRxBuf[ulPort]) >= 2))
                {
                    RingBufWriteOne(&g_sRxBuf[ulPort], ucChar);
                    RingBufWriteOne(&g_sRxBuf[ulPort], ucChar);
                }

                // If not a Telnet IAC character, only write it once.
                else if((ucChar != TELNET_IAC) &&
                        (RingBufFree(&g_sRxBuf[ulPort]) >= 1))
                {
                    RingBufWriteOne(&g_sRxBuf[ulPort], ucChar);
                }
            }

            // if not Telnet, then only write the data once.
            else
#endif

            {
                RingBufWriteOne(&g_sRxBuf[ulPort], ucChar);
            }
        }
    }

#ifdef SERIAL_FLOW_CONTROL
    // If flow control is enabled, check the status of the RX buffer to
    // determine if flow control GPIO needs to be asserted.
    if(g_sParameters.sPort[ulPort].ucFlowControl == SERIAL_FLOW_CONTROL_HW)
    {
        // If the ring buffer is down to less than 25% free, assert the
        // outbound flow control pin.
        if(RingBufFree(&g_sRxBuf[ulPort]) <
           (RingBufSize(&g_sRxBuf[ulPort]) / 4))
        {
            GPIOPinWrite(g_ulFlowOutBase[ulPort], g_ulFlowOutPin[ulPort],
                         g_ulFlowOutPin[ulPort]);
        }
    }
#endif

    // See if there is space to be filled in the transmit FIFO.
    if(ulStatus & UART_INT_TX)
    {
        // Loop while there is space in the transmit FIFO and characters to be
        // sent.
        while(!RingBufEmpty(&g_sTxBuf[ulPort]) &&
                UARTSpaceAvail(g_ulUARTBase[ulPort]))
        {
            // Write the next character into the transmit FIFO.
            UARTCharPut(g_ulUARTBase[ulPort], RingBufReadOne(&g_sTxBuf[ulPort]));
        }

        InputMode(ulPort);
    }
}

//*****************************************************************************
//! Handles the UART0 interrupt.
//!
//! This function is called when the UART generates an interrupt.  An interrupt
//! will be generated when data is received and when the transmit FIFO becomes
//! half empty.  The transmit and receive FIFOs are processed as appropriate.
//!
//! \return None.
//*****************************************************************************

void Uart0IntHandler(void)
{
  SerialUARTIntHandler(0);
}

void Uart4IntHandler(void)
{
  SerialUARTIntHandler(1);
}

void Uart3IntHandler(void)
{
  SerialUARTIntHandler(2);
}

void Uart2IntHandler(void)
{
  SerialUARTIntHandler(3);
}

void Uart1IntHandler(void)
{
  SerialUARTIntHandler(4);
}

#if false
//*****************************************************************************
//! Handles the serial flow control interrupt.
//!
//! \param ulPort is the serial port number to be accessed.
//!
//! This function is called when the GPIO interrupt occurs for a serial port
//! flow control GPIO input.  This function will clear the appropriate
//! interrupt condition, and will toggle the transmitter status based on the
//! flow control input signal level and the flow control setting.
//!
//! \return None.
//*****************************************************************************
static void
SerialFlowInIntHandler(uint32_t ulPort)
{
    uint32_t ulStatus;
#if CONFIG_RFC2217_ENABLED
    uint8_t ucModemState;
#endif

    // Clear the interrupt condition.
    ulStatus = GPIOIntStatus(g_ulFlowInBase[ulPort], true);
    GPIOIntClear(g_ulFlowInBase[ulPort], ulStatus);

    // If flow control is enabled, check the status of the pin and
    // enable/disable the UART transmitter appropriately.
    if(g_sParameters.sPort[ulPort].ucFlowControl == SERIAL_FLOW_CONTROL_HW)
    {
        if(GPIOPinRead(g_ulFlowInBase[ulPort], g_ulFlowInPin[ulPort]))
        {
            // Indicate the CTS (actually flow control input) has changed
            // state to be asserted.
#if CONFIG_RFC2217_ENABLED
            ucModemState = (16 + 1);
#endif
            HWREG(g_ulUARTBase[ulPort] + UART_O_CTL) &= ~UART_CTL_TXE;
        }
        else
        {
            // Indicate the CTS (actually flow control input) has changed
            // state to be deasserted.
#if CONFIG_RFC2217_ENABLED
            ucModemState = (0 + 1);
#endif
            HWREG(g_ulUARTBase[ulPort] + UART_O_CTL) |= UART_CTL_TXE;
        }

        // Notify the telnet RFC2217 process that RTS (actually flow control
        // input) has chagned state.
#if CONFIG_RFC2217_ENABLED
        TelnetNotifyModemState(ulPort, ucModemState);
#endif
    }
}

//*****************************************************************************
//! Handles the GPIO B interrupt for flow control (port 0).
//!
//! This function is called when the GPIO port B generates an interrupt.  An
//! interrupt will be generated when the inbound flow control signal changes
//! levels (rising/falling edge).  A notification function will be called to
//! inform the corresponding telnet session that the flow control signal has
//! changed.
//!
//! \return None.
//*****************************************************************************
void
SerialGPIOBIntHandler(void)
{
    // Call the generic flow control interrupt routine.
    SerialFlowInIntHandler(0);
}

//*****************************************************************************
//! Handles the GPIO A interrupt for flow control (port 1).
//!
//! This function is called when the GPIO port A generates an interrupt.  An
//! interrupt will be generated when the inbound flow control signal changes
//! levels (rising/falling edge).  A notification function will be called to
//! inform the corresponding telnet session that the flow control signal has
//! changed.
//!
//! \return None.
//*****************************************************************************
void
SerialGPIOAIntHandler(void)
{
    // Call the generic flow control interrupt routine.
    SerialFlowInIntHandler(1);
}

//*****************************************************************************
//! Enables transmitting and receiving.
//!
//! \param ulPort is the UART port number to be accessed.
//!
//! Sets the UARTEN, and RXE bits, and enables the transmit and receive
//! FIFOs.  Optionally sets the TXE bit if flow control conditions allow.
//!
//! \return None.
//*****************************************************************************
static void SerialUARTEnable(uint32_t ulPort)
{
    // Enable the FIFO.
    HWREG(g_ulUARTBase[ulPort] + UART_O_LCRH) |= UART_LCRH_FEN;

    // Enable RX and the UART.
    HWREG(g_ulUARTBase[ulPort] + UART_O_CTL) |= UART_CTL_UARTEN | UART_CTL_RXE;

